import { Factory, Casting, Furnace, Completion , stt , fur , lightMill , cast , instagram , linkedin , telegram , phone , email , twitter, Lab , Meta , Furna , mec} from "../assets";

export const navLinks = [
  {
    id: "contact",
    title: "ارتباط با ما",
  },

  {
    id: "factories",
    title: "کارخانه ها",
  },
  {
    id: "labs",
    title: "آزمایشگاه ها",
  },
  {
    id: "equipment",
    title: "تجهیزات",
  },
  {
    id: "about",
    title: "درباره ی ما",
  },
];

const services = [
  {
    title: "کارخانجات فولادسازی",
    icon: Factory,
  },
  {
    title: "نورد مقاطع سبک",
    icon: Casting,
  },
  {
    title: "عملیات حرارتی",
    icon: Furnace,
  },
  {
    title: "تکمیل کاری",
    icon: Completion,
  },
];



const Factories = [
  {
    title: "کارخانه فولادسازی",
    company_name: "NEGIN STEEL COMPANY",
    icon: stt,
    iconBg: "#383E56",
    date: "",
    points: [
      "کارخانه‌های فولاد یکی از اقسام اصلی صنعت فلزات هستند",
      "فولاد به عنوان یک ماده ساختمانی اساسی، در ساخت و سازهای مختلف مانند ساختمان‌ها، پل‌ها، خودروها، و ماشین‌آلات مورد استفاده قرار می‌گیرد        ",
      "کارخانه‌های فولاد به دلیل اندازه بزرگ و نیاز به نیروی انسانی در حجم بالا، ایجاد اشتغال زیادی در جامعه محلی و توسعه اقتصادی را تسهیل می‌کنند        ",
      "تلاش برای بهره‌گیری از فناوری‌های پایدار و کاهش اثرات منفی بر محیط زیست می‌تواند کارخانه‌های فولاد را در جهت توسعه پایدار هدایت کند        ",
    ],
  },
  {
    title: "کارخانه نورد سبک",
    company_name: "(Light Section Mill)",
    icon: lightMill,
    iconBg: "#E6DEDD",
    date: "",
    points: [
      "نورد سبک قابلیت تولید محصولات چند منظوره از جمله میلگرد، نبشی، و تیرآهن را دارد. این امکان به کارخانه این امکان را می‌دهد که محصولات متنوعی با استفاده از یک تجهیزات را تولید کند        ",
      "نورد سبک با تنظیمات دقیق و استفاده از تکنولوژی‌های پیشرفته، به کاهش هدر رفت مواد می‌انجامد و از بهره‌وری بهتری در تولید بهره‌مند می‌شود        ",
      "نورد سبک معمولاً سرعت بالایی در تولید دارد که این امر منجر به افزایش حجم تولید در یک دوره زمانی مشخص و کاهش هزینه‌های تولید می‌شود",
      "مهمترین عوامل در تولید محصولات فولادی، درجه حرارت است نورد سبک با تجهیز به سیستم‌های کنترل دقیق درجه حرارت، به تولید محصولات با ویژگی‌های مشخص کمک می‌کند",
    ],
  },
  {
    title: "کارگاه ذوب",
    company_name:
      "   (VOD)ویک واحد(VD) یک واحد ،(LF)استفاده از یک کورة قوس الکتریکی، یک کوره پاتیلی",
    icon: fur,
    iconBg: "#383E56",
    date: "",
    points: [
      "کارگاه ذوب مسئولیت تولید آهن مایع (فولاد) از مواد خام مثل خاکسترو سایر فلزات را دارد این فرآیند اولیه اساسی برای تولید فولاد است",
      "کارگاه ذوب امکان تولید فولاد با ترکیبات مختلف را فراهم می‌کند که این امکان را به کارخانه می‌دهد تا محصولات با خصوصیات مختلف را تولید کند",
      "استفاده از تجهیزات مدرن و به‌روز در کارگاه ذوب، منجر به افزایش بهره‌وری و کاهش هدر رفت منابع می‌شود        ",
      "کارگاه ذوب مجهز به تجهیزات پیشرفته برای کنترل دقیق فرآیند ذوب فلزات می‌باشد. این کنترل دقیق بهبود کیفیت فلزات تولید شده را تضمین می‌کند        ",
    ],
  },
  {
    title: "کارگاه ریخته گری",
    company_name: "(continuous casting) ماشین ریخته گری مداوم",
    icon: cast,
    iconBg: "#E6DEDD",
    date: "",
    points: [
      "با ابعاد 150*150- 125*125 *100*100 میلیمتر",
      "افزایش بهره‌وری و کاهش هدر رفت مواد",
      " استفاده از ماشین ریخته‌گری مداوم باعث کاهش نیاز به پردازشهای متقابل برای اصلاح شکل و ابعاد می شود که این مزیت به کاهش هزینه‌ها و زمان تولید کمک می‌کن",
      " ماشین ریخته‌گری مداوم به دلیل اتوماسیون بالا و کنترل دقیق پارامترهای بهود کیفیت نهایی محصولات را فراهم می‌کند. این امر شامل کاهش ناخالصی‌ها، تسطیح بهتر سطح، و کنترل دقیق ابعاد می‌شود",
    ],
  },
];

const technologies = [
  {
    name: "Instagram",
    title: "Instagram",
    icon: instagram,
  },
  {
    name: "Linkedin",
    title: "Linkedin",
    icon: linkedin,
  },
  {
    name: "Twitter",
    title: "Twitter",
    icon: twitter,
  },
  {
    name: "Telegram",
    title: "Telegram",
    icon: telegram,
  },
  {
    name: "Phone",
    title: "Phone",
    icon: phone,
  },
  {
    name: "Email",
    title: "Email",
    icon: email,
  },
  
];

const testimonials = [
  {
    testimonial: "",
    name: "کوره گامی",
    designation: "(Reheating Walking Beam Furnace)",
  },
  {
    testimonial: "",
    name: "بستر خنک کننده در هوا",
    designation: "(cooling in air)",
  },
  {
    testimonial: "",
    name: "کوئنچ در آب",
    designation: "(water quench)",
  },
  {
    testimonial: "",
    name: "آنیل توده ای",
    designation: "(pack annealing)",
  },
  {
    testimonial: "",
    name: " قفسه نورد رفت و برگشتی",
    designation: "(Roughing)",
  },
  {
    testimonial: "",
    name: "کوره نگهدارنده",
    designation: "(Holding Furnace)",
  },
  {
    testimonial: "",
    name: "تراش غلتک های نورد",
    designation: "CNC",
  },
  {
    testimonial: "",
    name: "تجهیزات ترمکس",
    designation: "",
  },
];
const projects = [
  {
    name: "آزمایشگاه طیف سنجی",
    description:
      "آزمایشگاه طیف سنجی این آزمایشگاه با استفاده از تجهیزات پیشرفته زیر قادر به تشخیص و تعیین غلظت عناصر و تعیین جنس فلزات و آلیاژهایشان می باشد. دستگاه کوانتومتر توانایی اندازه گیری ۲۸ عنصر در فولاد و ۲۲ عنصر در چدن با حد تشخیص ppm دو دستگاه دستگاههای لکو : Leco) جهت اندازه گیری کربن سولفور ،اکسیژن ،نیتروژن هیدروژن رطوبت و کربن سطح در محدوده ppm",

    image: Lab,
  },
  {
    name: "آزمایشگاه متالوگرافی",
    description:
      "آزمایشگاه متالوگرافی با استفاده از تجهیزات مدرن و دقیق زیر قادر به تعیین ساختار ماکروسکوپی یا میکروسکوپی قطعات فلزی و تعیین اندازه دانه ها تعیین ناخالصی تعیین توزیع و اندازه گاربید و عمق دکربوره می باشد میکروسکوپ نوری با بزرگنمایی تا ۲۸۰۰ و دوربینهای عکاسی و ویدیوئی (۱) دستگاه بررسی مقاطع شکست بصورت سه بعدی با میکروسکوپ استریو آنالیز تصویری با میکروسکوپ Leica و امکان تعیین ناخالصی طبق استانداردهای مختلف JIS, ASTM DIN",
    image: Meta,
  },
  {
    name: "آزمایشگاه عملیات حرارتی",
    description:
      "آزمایشگاه عملیات حرارتی امکان انجام آزمایش سختی پذیری به روش جمینی با کوره 1100 C و سختی سنج راکول ساخت EMCO و نرم افزارهای لازم برای ترسیم منحنی سختی پذیری امکان عملیات حرارتی سیکلهای مختلف با دمای 500 تا 1550 C",
    image: Furna,
  },
  {
    name: "آزمایشگاه خواص مکانیکی",
    description:
      " /   آزمایشگاه خواص مکانیکی سختی سنجی ،برینل راکول ویکرز یونیورسال دستگاه آماده سازی نمونه اتوماتیک کارگاه آماده سازی نمونه",
    image: mec,
  },
];

export { services , Factories , testimonials ,technologies, projects };
